# PlanTopology Property

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DocumentEntryPoint..::..PlanTopology Property
DocumentEntryPoint Class See Also
---
Gets the PlanTopology of a given level.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| [PlanTopology[([( Level])]) ](fb7a12ec-d4d7-b3a5-3613-5ee23d45c52f.md "PlanTopology Property \(Level\)") | Get the PlanTopology of a given level in the last phase. (Inherited from Document.) |
| [PlanTopology[([( Level, Phase])]) ](215a0d2b-0f9f-1532-cb15-d1f6a2af029a.md "PlanTopology Property \(Level, Phase\)") | Get the PlanTopology of a given level in a given phase. (Inherited from Document.) |

# See Also
DocumentEntryPoint Class
DocumentEntryPoint Members
Autodesk.Revit.DB.Macros Namespace